#Bài tập môn dịch vụ mạng.

##Bài số 2.

###Mô hình 1:

![scr1](http://i.imgur.com/caaysa4.png)

**Hướng dẫn thực hiện**

- Mình sẽ làm với sơ đồ giống với đề bài nhưng dữ liệu khác, dưới đây là mô hình mình thực hiện :

![scr2](http://i.imgur.com/WIWlCUm.png)

- Để thực hiện cấu hình `Vlan` và `DHCP` chúng ta thực hiện các bước sau đây :

- Đầu tiên cấu hình `Vlan` trên switch.

- Cấu hình như sau :

```sh
Switch(config)#vlan 100 //tạo vlan 100
Switch(config-vlan)#name vlanpc //đặt tên cho vlan đó
Switch(config-vlan)#exit
Switch(config)#vlan 200
Switch(config-vlan)#name vlanlaptop
Switch(config-vlan)#exit
```

- OK tiếp theo là chúng ta cần phải cấu hình các cổng thuộc Vlan đó.

- Theo như sơ đồ thì chúng ta có f0/1 - f0/3 thuộc Vlan 100 ; Còn từ f0/4 - f0/6 thuộc Vlan200 ; ở đây chúng ta dùng `interface range` để giảm thiểu đi câu lệnh cần thực hiện:

```sh
Switch(config)#interface range f0/1 - f0/3
Switch(config-if-range)#switchport access vlan 100
Switch(config-if-range)#exit
Switch(config)#interface range f0/4 - f0/6
Switch(config-if-range)#switchport access vlan 200
Switch(config-if-range)#exit
```

- Sau đó chúng ta cấu hình địa chỉ IP cho từng Vlan.

```sh
Switch(config)#interface vlan 100
Switch(config-if)#ip address 172.16.1.1 255.255.255.0
Switch(config-if)#no shutdown 
Switch(config-if)#exit
Switch(config)#interface vlan 200
Switch(config-if)#ip address 172.16.2.1 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#exit
```

- Bước tiếp theo là tạo `pool DHCP` để cấp phát địa chỉ tự động.

- Thực hiện các câu lệnh sau :

```sh
Switch(config)#ip dhcp pool vlan100
Switch(dhcp-config)#network 172.16.1.0 255.255.255.0
Switch(dhcp-config)#default-router 172.16.1.1
Switch(dhcp-config)#exit
Switch(config)#ip dhcp pool vlan200
Switch(dhcp-config)#network 172.16.2.0 255.255.255.0
Switch(dhcp-config)#default-router 172.16.2.1
Switch(dhcp-config)#exit
```

- Cuối cùng chúng ta cần bật `DHCP` trên các host để nhận cấu hình là xong

![scr3](http://i.imgur.com/ThKX4YG.png)

![scr4](http://i.imgur.com/HevCp8L.png)

- Chúc mọi người thành công :D


###Mô hình 2:

- Dưới đây là đề bài:

![scr6](http://i.imgur.com/B4kWBgB.png)

- Mình sẽ thực hiện với sơ đồ giống đề bài nhưng số liệu sẽ thay đổi do mình, đây là sơ đồ mình sẽ thực hiện :

![scr7](http://i.imgur.com/8eTjX6D.png)

- OK bắt đầu thôi .

- Đầu tiên là cấu hình trên Router trước nhé :D ; Thực hiện cấu hình địa chỉ IP để thông với Switch `Core` ở giữa.

```sh
Router(config)#interface gig0/0
Router(config-if)#ip address 172.16.1.1 255.255.255.0
Router(config-if)#no shutdown
```

- Ok, Chuyển sang con Switch nhé :D , cấu hình để sw thông với R:

```sh
Switch(config)#interface f0/1
Switch(config-if)#no switchport
Switch(config-if)#ip address 172.16.1.2 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#exit
```

- Tiếp theo chúng ta tạo Vlan giống như mô hình trên , ở đây mình không đặt tên, nếu như yêu cầu ở đề của thầy thì mọi người thêm tên vlan vào nhé :

```sh
Switch(config)#vlan 2
Switch(config-vlan)#exit
Switch(config)#vlan 3
Switch(config-vlan)#exit
Switch(config)#vlan 4
Switch(config-vlan)#exit
```

- Sau đó chúng ta gắn port vào Vlan : 

```sh
Switch(config)#interface f0/2
Switch(config-if)#switchport access vlan 2
Switch(config-if)#exit
Switch(config)#interface f0/3
Switch(config-if)#switchport access vlan 3
Switch(config-if)#exit
Switch(config)#interface f0/4
Switch(config-if)#switchport access vlan 4
Switch(config-if)#exit
```

- Sau đó cài đặt địa chỉ IP cho Vlan :

```sh
Switch(config)#interface vlan 2
Switch(config-if)#ip address 172.16.2.1 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#exit
Switch(config)#interface vlan 3
Switch(config-if)#ip address 172.16.3.1 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#exit
Switch(config)#interface vlan 4
Switch(config-if)#ip address 172.16.4.1 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#exit
```

- OK , bước tiếp theo tạo pool DHCP:

```sh
Switch(config)#ip dhcp pool vlan2
Switch(dhcp-config)#network 172.16.2.0 255.255.255.0
Switch(dhcp-config)#default-router 172.16.2.1
Switch(dhcp-config)#exit
Switch(config)#ip dhcp pool vlan3
Switch(dhcp-config)#network 172.16.3.0 255.255.255.0
Switch(dhcp-config)#default-router 172.16.3.1
Switch(dhcp-config)#exit
Switch(config)#ip dhcp pool vlan4
Switch(dhcp-config)#network 172.16.4.0 255.255.255.0
Switch(dhcp-config)#default-router 172.16.4.1
Switch(dhcp-config)#exit
```

- Tiếp theo chúng ta thực hiện bật DHCP trên host và thực hiện cấu hình định tuyến trên Router cũng như Switch.

- Ở đây mình dùng giao thức định tuyến RIPv2

- Cấu hình định tuyến trên Switch:

```sh
Switch(config)#ip routing
Switch(config)#router rip
Switch(config-router)#version 2
Switch(config-router)#network 172.16.1.0
Switch(config-router)#network 172.16.2.0
Switch(config-router)#network 172.16.3.0
Switch(config-router)#network 172.16.4.0
Switch(config-router)#no auto-summary
```

- Cấu hình định tuyến trên Router :

```sh
Router(config)#router rip
Router(config-router)#version 2
Router(config-router)#network 172.16.1.0
Router(config-router)#no auto-summary
```

- OK chúng ta thực hiện `PING` hoặc gửi `PDU` để kiểm tra thôi :D

![scr8]()http://i.imgur.com/15UR17I.png

- Chúc các bạn thành công :D 